# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [4]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
user_id = pd.read_csv(url,sep='|')

### Step 4. See the first 25 entries

In [ ]:
user_id.head(25)

### Step 5. See the last 10 entries

In [ ]:
user_id.tail(10)

### Step 6. What is the number of observations in the dataset?

In [58]:
# user_id.count()
user_id.info()
# user_id.shape[0]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
user_id       943 non-null int64
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(2), object(3)
memory usage: 36.9+ KB

### Step 7. What is the number of columns in the dataset?

In [59]:
user_id.shape[1]

5

### Step 8. Print the name of all the columns.

In [17]:
user_id.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [19]:
user_id.index

RangeIndex(start=0, stop=943, step=1)

### Step 10. What is the data type of each column?

In [ ]:
user_id.dtypes

### Step 11. Print only the occupation column

In [ ]:
# print(user_id.occupation)
user_id['occupation']

### Step 12. How many different occupations there are in this dataset?

In [60]:
user_id.occupation.nunique()
# len(user_id.occupation.unique())

21

In [41]:
user_id.occupation.value_counts().count()

21

### Step 13. What is the most frequent occupation?

In [43]:
user_id.occupation.value_counts().head(1)

student    196
Name: occupation, dtype: int64

### Step 14. Summarize the DataFrame.

In [61]:
user_id.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

### Step 15. Summarize all the columns

In [62]:
user_id.describe(include = 'all')

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [63]:
user_id.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [55]:
user_id.age.mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [67]:
user_id.age.value_counts().tail(5)

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64